MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014/mcu.h
extern volatile C1CFG1BITS C1CFG1bits __attribute__((__sfr__));

#define C1CFG2 C1CFG2
extern volatile uint16_t C1CFG2 __attribute__((__sfr__));
__extension__ typedef struct tagC1CFG2BITS {
  union {
    struct {
      uint16_t PRSEG:3;
      uint16_t SEG1PH:3;
      uint16_t SAM:1;
      uint16_t SEG2PHTS:1;
      uint16_t SEG2PH:3;
      uint16_t :3;
      uint16_t WAKFIL:1;
    };
    struct {
      uint16_t PRSEG0:1;
      uint16_t PRSEG1:1;
      uint16_t PRSEG2:1;
      uint16_t SEG1PH0:1;
      uint16_t SEG1PH1:1;
      uint16_t SEG1PH2:1;
      uint16_t :2;
      uint16_t SEG2PH0:1;
      uint16_t SEG2PH1:1;
      uint16_t SEG2PH2:1;
    };
  };
} C1CFG2BITS;
extern volatile C1CFG2BITS C1CFG2bits __attribute__((__sfr__));

#define C1INTF C1INTF
extern volatile uint16_t C1INTF __attribute__((__sfr__));
__extension__ typedef struct tagC1INTFBITS {
  union {
    struct {
      uint16_t RXB0IF:1;
      uint16_t RXB1IF:1;
      uint16_t TXB0IF:1;
      uint16_t TXB1IF:1;
      uint16_t TXB2IF:1;
      uint16_t ERRIF:1;
      uint16_t WAKIF:1;
      uint16_t IRXIF:1;
      uint16_t EWARN:1;
      uint16_t RXWARN:1;
      uint16_t TXWARN:1;
      uint16_t RXBP:1;
      uint16_t TXBP:1;
      uint16_t TXBO:1;
      uint16_t RXB1OVFL:1;
      uint16_t RXB0OVFL:1;
    };
    struct {
      uint16_t RX0IF:1;
      uint16_t RX1IF:1;
      uint16_t TX0IF:1;
      uint16_t TX1IF:1;
      uint16_t TX2IF:1;
      uint16_t :2;
      uint16_t IVRIF:1;
      uint16_t :1;
      uint16_t RXWAR:1;
      uint16_t TXWAR:1;
      uint16_t RXEP:1;
      uint16_t TXEP:1;
      uint16_t :1;
      uint16_t RX1OVR:1;
      uint16_t RX0OVR:1;
    };
  };
} C1INTFBITS;
extern volatile C1INTFBITS C1INTFbits __attribute__((__sfr__));

#define C1INTE C1INTE
extern volatile uint16_t C1INTE __attribute__((__sfr__));
__extension__ typedef struct tagC1INTEBITS {
  union {
    struct {
      uint16_t RXB0IE:1;
      uint16_t RXB1IE:1;
      uint16_t TXB0IE:1;
      uint16_t TXB1IE:1;
      uint16_t TXB2IE:1;
      uint16_t ERRIE:1;
      uint16_t WAKIE:1;
      uint16_t IRXIE:1;
    };
    struct {
      uint16_t RX0IE:1;
      uint16_t RX1IE:1;
      uint16_t TX0IE:1;
      uint16_t TX1IE:1;
      uint16_t TX2IE:1;
      uint16_t :2;
      uint16_t IVRIE:1;
    };
  };
} C1INTEBITS;
extern volatile C1INTEBITS C1INTEbits __attribute__((__sfr__));

#define C1EC C1EC
extern volatile uint16_t C1EC __attribute__((__sfr__));
typedef struct tagC1ECBITS {
  uint16_t REC0:1;
  uint16_t REC1:1;
  uint16_t REC2:1;
  uint16_t REC3:1;
  uint16_t REC4:1;
  uint16_t REC5:1;
  uint16_t REC6:1;
  uint16_t REC7:1;
  uint16_t TEC0:1;
  uint16_t TEC1:1;
  uint16_t TEC2:1;
  uint16_t TEC3:1;
  uint16_t TEC4:1;
  uint16_t TEC5:1;
  uint16_t TEC6:1;
  uint16_t TEC7:1;
} C1ECBITS;
extern volatile C1ECBITS C1ECbits __attribute__((__sfr__));

#define C1RERRCNT C1RERRCNT
extern volatile uint8_t C1RERRCNT __attribute__((__sfr__));
#define C1TERRCNT C1TERRCNT
extern volatile uint8_t C1TERRCNT __attribute__((__sfr__));

/* SFR blocks for each CAN module */
#define CAN2 CAN2
extern volatile CAN CAN2 __attribute__((__sfr__));

#define C2RXF0SID C2RXF0SID
extern volatile uint16_t C2RXF0SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF0SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF0SIDBITS;
extern volatile C2RXF0SIDBITS C2RXF0SIDbits __attribute__((__sfr__));

#define C2RXF0EIDH C2RXF0EIDH
extern volatile uint16_t C2RXF0EIDH __attribute__((__sfr__));
typedef struct tagC2RXF0EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF0EIDHBITS;
extern volatile C2RXF0EIDHBITS C2RXF0EIDHbits __attribute__((__sfr__));

#define C2RXF0EIDL C2RXF0EIDL
extern volatile uint16_t C2RXF0EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF0EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF0EIDLBITS;
extern volatile C2RXF0EIDLBITS C2RXF0EIDLbits __attribute__((__sfr__));

#define C2RXF1SID C2RXF1SID
extern volatile uint16_t C2RXF1SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF1SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF1SIDBITS;
extern volatile C2RXF1SIDBITS C2RXF1SIDbits __attribute__((__sfr__));

#define C2RXF1EIDH C2RXF1EIDH
extern volatile uint16_t C2RXF1EIDH __attribute__((__sfr__));
typedef struct tagC2RXF1EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXF1EIDHBITS;
extern volatile C2RXF1EIDHBITS C2RXF1EIDHbits __attribute__((__sfr__));

#define C2RXF1EIDL C2RXF1EIDL
extern volatile uint16_t C2RXF1EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF1EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXF1EIDLBITS;
extern volatile C2RXF1EIDLBITS C2RXF1EIDLbits __attribute__((__sfr__));

#define C2RXF2SID C2RXF2SID
extern volatile uint16_t C2RXF2SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXF2SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXF2SIDBITS;
extern volatile C2RXF2SIDBITS C2RXF2SIDbits __attribute__((__sfr__));

