MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014/mcu.h
#define _IFS0_CNIF_POSITION                      0x0000000F
#define _IFS0_CNIF_MASK                          0x00008000
#define _IFS0_CNIF_LENGTH                        0x00000001

#define _IFS1_INT1IF_POSITION                    0x00000000
#define _IFS1_INT1IF_MASK                        0x00000001
#define _IFS1_INT1IF_LENGTH                      0x00000001

#define _IFS1_IC7IF_POSITION                     0x00000001
#define _IFS1_IC7IF_MASK                         0x00000002
#define _IFS1_IC7IF_LENGTH                       0x00000001

#define _IFS1_IC8IF_POSITION                     0x00000002
#define _IFS1_IC8IF_MASK                         0x00000004
#define _IFS1_IC8IF_LENGTH                       0x00000001

#define _IFS1_OC3IF_POSITION                     0x00000003
#define _IFS1_OC3IF_MASK                         0x00000008
#define _IFS1_OC3IF_LENGTH                       0x00000001

#define _IFS1_OC4IF_POSITION                     0x00000004
#define _IFS1_OC4IF_MASK                         0x00000010
#define _IFS1_OC4IF_LENGTH                       0x00000001

#define _IFS1_T4IF_POSITION                      0x00000005
#define _IFS1_T4IF_MASK                          0x00000020
#define _IFS1_T4IF_LENGTH                        0x00000001

#define _IFS1_T5IF_POSITION                      0x00000006
#define _IFS1_T5IF_MASK                          0x00000040
#define _IFS1_T5IF_LENGTH                        0x00000001

#define _IFS1_INT2IF_POSITION                    0x00000007
#define _IFS1_INT2IF_MASK                        0x00000080
#define _IFS1_INT2IF_LENGTH                      0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000008
#define _IFS1_U2RXIF_MASK                        0x00000100
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x00000009
#define _IFS1_U2TXIF_MASK                        0x00000200
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_SPI2IF_POSITION                    0x0000000A
#define _IFS1_SPI2IF_MASK                        0x00000400
#define _IFS1_SPI2IF_LENGTH                      0x00000001

#define _IFS1_C1IF_POSITION                      0x0000000B
#define _IFS1_C1IF_MASK                          0x00000800
#define _IFS1_C1IF_LENGTH                        0x00000001

#define _IFS1_IC3IF_POSITION                     0x0000000C
#define _IFS1_IC3IF_MASK                         0x00001000
#define _IFS1_IC3IF_LENGTH                       0x00000001

#define _IFS1_IC4IF_POSITION                     0x0000000D
#define _IFS1_IC4IF_MASK                         0x00002000
#define _IFS1_IC4IF_LENGTH                       0x00000001

#define _IFS1_IC5IF_POSITION                     0x0000000E
#define _IFS1_IC5IF_MASK                         0x00004000
#define _IFS1_IC5IF_LENGTH                       0x00000001

#define _IFS1_IC6IF_POSITION                     0x0000000F
#define _IFS1_IC6IF_MASK                         0x00008000
#define _IFS1_IC6IF_LENGTH                       0x00000001

#define _IFS2_OC5IF_POSITION                     0x00000000
#define _IFS2_OC5IF_MASK                         0x00000001
#define _IFS2_OC5IF_LENGTH                       0x00000001

#define _IFS2_OC6IF_POSITION                     0x00000001
#define _IFS2_OC6IF_MASK                         0x00000002
#define _IFS2_OC6IF_LENGTH                       0x00000001

#define _IFS2_OC7IF_POSITION                     0x00000002
#define _IFS2_OC7IF_MASK                         0x00000004
#define _IFS2_OC7IF_LENGTH                       0x00000001

#define _IFS2_OC8IF_POSITION                     0x00000003
#define _IFS2_OC8IF_MASK                         0x00000008
#define _IFS2_OC8IF_LENGTH                       0x00000001

#define _IFS2_INT3IF_POSITION                    0x00000004
#define _IFS2_INT3IF_MASK                        0x00000010
#define _IFS2_INT3IF_LENGTH                      0x00000001

#define _IFS2_INT4IF_POSITION                    0x00000005
#define _IFS2_INT4IF_MASK                        0x00000020
#define _IFS2_INT4IF_LENGTH                      0x00000001

#define _IFS2_C2IF_POSITION                      0x00000006
#define _IFS2_C2IF_MASK                          0x00000040
#define _IFS2_C2IF_LENGTH                        0x00000001

#define _IFS2_DCIIF_POSITION                     0x00000009
#define _IFS2_DCIIF_MASK                         0x00000200
#define _IFS2_DCIIF_LENGTH                       0x00000001

#define _IFS2_LVDIF_POSITION                     0x0000000A
#define _IFS2_LVDIF_MASK                         0x00000400
#define _IFS2_LVDIF_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000004
#define _IEC0_IC2IE_MASK                         0x00000010
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000005
#define _IEC0_OC2IE_MASK                         0x00000020
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_T2IE_POSITION                      0x00000006
#define _IEC0_T2IE_MASK                          0x00000040
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_T3IE_POSITION                      0x00000007
#define _IEC0_T3IE_MASK                          0x00000080
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_SPI1IE_POSITION                    0x00000008
#define _IEC0_SPI1IE_MASK                        0x00000100
#define _IEC0_SPI1IE_LENGTH                      0x00000001

#define _IEC0_U1RXIE_POSITION                    0x00000009
#define _IEC0_U1RXIE_MASK                        0x00000200
#define _IEC0_U1RXIE_LENGTH                      0x00000001

