MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014/mcu.h
#define _IEC0_U1TXIE_POSITION                    0x0000000A
#define _IEC0_U1TXIE_MASK                        0x00000400
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_ADIE_POSITION                      0x0000000B
#define _IEC0_ADIE_MASK                          0x00000800
#define _IEC0_ADIE_LENGTH                        0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000C
#define _IEC0_NVMIE_MASK                         0x00001000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC0_SI2CIE_POSITION                    0x0000000D
#define _IEC0_SI2CIE_MASK                        0x00002000
#define _IEC0_SI2CIE_LENGTH                      0x00000001

#define _IEC0_MI2CIE_POSITION                    0x0000000E
#define _IEC0_MI2CIE_MASK                        0x00004000
#define _IEC0_MI2CIE_LENGTH                      0x00000001

#define _IEC0_CNIE_POSITION                      0x0000000F
#define _IEC0_CNIE_MASK                          0x00008000
#define _IEC0_CNIE_LENGTH                        0x00000001

#define _IEC1_INT1IE_POSITION                    0x00000000
#define _IEC1_INT1IE_MASK                        0x00000001
#define _IEC1_INT1IE_LENGTH                      0x00000001

#define _IEC1_IC7IE_POSITION                     0x00000001
#define _IEC1_IC7IE_MASK                         0x00000002
#define _IEC1_IC7IE_LENGTH                       0x00000001

#define _IEC1_IC8IE_POSITION                     0x00000002
#define _IEC1_IC8IE_MASK                         0x00000004
#define _IEC1_IC8IE_LENGTH                       0x00000001

#define _IEC1_OC3IE_POSITION                     0x00000003
#define _IEC1_OC3IE_MASK                         0x00000008
#define _IEC1_OC3IE_LENGTH                       0x00000001

#define _IEC1_OC4IE_POSITION                     0x00000004
#define _IEC1_OC4IE_MASK                         0x00000010
#define _IEC1_OC4IE_LENGTH                       0x00000001

#define _IEC1_T4IE_POSITION                      0x00000005
#define _IEC1_T4IE_MASK                          0x00000020
#define _IEC1_T4IE_LENGTH                        0x00000001

#define _IEC1_T5IE_POSITION                      0x00000006
#define _IEC1_T5IE_MASK                          0x00000040
#define _IEC1_T5IE_LENGTH                        0x00000001

#define _IEC1_INT2IE_POSITION                    0x00000007
#define _IEC1_INT2IE_MASK                        0x00000080
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC1_U2RXIE_POSITION                    0x00000008
#define _IEC1_U2RXIE_MASK                        0x00000100
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x00000009
#define _IEC1_U2TXIE_MASK                        0x00000200
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_SPI2IE_POSITION                    0x0000000A
#define _IEC1_SPI2IE_MASK                        0x00000400
#define _IEC1_SPI2IE_LENGTH                      0x00000001

#define _IEC1_C1IE_POSITION                      0x0000000B
#define _IEC1_C1IE_MASK                          0x00000800
#define _IEC1_C1IE_LENGTH                        0x00000001

#define _IEC1_IC3IE_POSITION                     0x0000000C
#define _IEC1_IC3IE_MASK                         0x00001000
#define _IEC1_IC3IE_LENGTH                       0x00000001

#define _IEC1_IC4IE_POSITION                     0x0000000D
#define _IEC1_IC4IE_MASK                         0x00002000
#define _IEC1_IC4IE_LENGTH                       0x00000001

#define _IEC1_IC5IE_POSITION                     0x0000000E
#define _IEC1_IC5IE_MASK                         0x00004000
#define _IEC1_IC5IE_LENGTH                       0x00000001

#define _IEC1_IC6IE_POSITION                     0x0000000F
#define _IEC1_IC6IE_MASK                         0x00008000
#define _IEC1_IC6IE_LENGTH                       0x00000001

#define _IEC2_OC5IE_POSITION                     0x00000000
#define _IEC2_OC5IE_MASK                         0x00000001
#define _IEC2_OC5IE_LENGTH                       0x00000001

#define _IEC2_OC6IE_POSITION                     0x00000001
#define _IEC2_OC6IE_MASK                         0x00000002
#define _IEC2_OC6IE_LENGTH                       0x00000001

#define _IEC2_OC7IE_POSITION                     0x00000002
#define _IEC2_OC7IE_MASK                         0x00000004
#define _IEC2_OC7IE_LENGTH                       0x00000001

#define _IEC2_OC8IE_POSITION                     0x00000003
#define _IEC2_OC8IE_MASK                         0x00000008
#define _IEC2_OC8IE_LENGTH                       0x00000001

#define _IEC2_INT3IE_POSITION                    0x00000004
#define _IEC2_INT3IE_MASK                        0x00000010
#define _IEC2_INT3IE_LENGTH                      0x00000001

#define _IEC2_INT4IE_POSITION                    0x00000005
#define _IEC2_INT4IE_MASK                        0x00000020
#define _IEC2_INT4IE_LENGTH                      0x00000001

#define _IEC2_C2IE_POSITION                      0x00000006
#define _IEC2_C2IE_MASK                          0x00000040
#define _IEC2_C2IE_LENGTH                        0x00000001

#define _IEC2_DCIIE_POSITION                     0x00000009
#define _IEC2_DCIIE_MASK                         0x00000200
#define _IEC2_DCIIE_LENGTH                       0x00000001

#define _IEC2_LVDIE_POSITION                     0x0000000A
#define _IEC2_LVDIE_MASK                         0x00000400
#define _IEC2_LVDIE_LENGTH                       0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

